RIET/src/Enums/LoadingTypes/LoadingTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoadingTypes</name>
  <enumValues>
    <name>Top</name>
  </enumValues>
  <enumValues>
    <name>Side</name>
  </enumValues>
  <enumValues>
    <name>Back</name>
  </enumValues>
  <enumValues>
    <name>FullRastentovka</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/LoadingTypes/ManagerModule.bsl
Функция ПолучитьПредставлениеLoadingTypeRU(LoadingType) Экспорт
	
	LoadingTypes = Перечисления.LoadingTypes;
	Если LoadingType = LoadingTypes.Back Тогда 
		Возврат "задняя";
	ИначеЕсли LoadingType = LoadingTypes.FullRastentovka Тогда 
		Возврат "полная растентовка";
	ИначеЕсли LoadingType = LoadingTypes.Side Тогда 
		Возврат "боковая";
	ИначеЕсли LoadingType = LoadingTypes.Top Тогда 
		Возврат "верхняя";
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции
